app/controllers/profiles_controller.rb

  def create
  	 @profile = current_user.build_profile(profile_params)
  	 @profile.user_id = current_user.id
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "user_id" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["user_id", nil], ["updated_at", 2016-09-23 03:18:55 UTC], ["id", 1]]